Revit 2027 API
FabricationConfiguration.PostReviewableWarningsForBadConnections Method
 Reviewable warnings are created for all entries contained in the connection validation information.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void PostReviewableWarningsForBadConnections(
	ConnectionValidationInfo info
)
Public Sub PostReviewableWarningsForBadConnections (
	info As ConnectionValidationInfo
)
public:
void PostReviewableWarningsForBadConnections(
	ConnectionValidationInfo^ info
)
member PostReviewableWarningsForBadConnections :
        info : ConnectionValidationInfo -> unit
Parameters
info ConnectionValidationInfo
 The connection information created from the connection validation check.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  this operation failed.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace